#Без использования collections, написать программу, которая будет
#создавать словарь для подсчитывания количества вхождений каждой
#буквы в текст введенный с клавиатуры

some_txt = input()
some_dict = {}
some_dict.update(some_txt)

print(some_dict)
